#include <iostream>
#include <windows.h>
#include <algorithm>
#include <conio.h>

using namespace std;

void SetConsoleView(){
    system("mode con:cols=65 lines=25");
    system("title Lucky Number Game");
}

int main()
{
    SetConsoleView();

    cout << "*****************************************************************\n";
    cout << "*                                                               *\n";
    cout << "*             < 복권 번호 추첨을 시작하겠습니까? >              *\n";
    cout << "*                                                               *\n";
    cout << "*****************************************************************\n";
    cout << "1등 : 1억원\n";
    cout << "2등 : 5000만원\n";
    cout << "3등 : 1000만원\n";

    cout << "Yes or No\n";

    string s;
    cin >> s;
    if(s=="No"){
        system("cls");
        return 0;
    }
    system("cls");

    int arr[6];

    cout << "                   !복권 번호를 입력해주세요!                    \n";
    cout << "*****************************************************************\n";
    cout << "*                                                               *\n";
    cout << "*         <  >    <  >    <  >    <  >    <  >    <  >          *\n";
    cout << "*                                                               *\n";
    cout << "*****************************************************************\n";
    cout << "입력해주세요 :";

    for(int i=0;i<6;i++){
        cin >> arr[i];
    }
    system("cls");

    int ans[6];
    for(int i=0;i<6;i++){
        ans[i] = rand()%6;
    }

    int cnt=0;
    cout << "                   <!복권 번호 추첨 드가자!>                     \n";
    cout << "*****************************************************************\n";
    cout << "*                                                               *\n";
    cout << "*         <  >    <  >    <  >    <  >    <  >    <  >          *\n";
    cout << "*                                                               *\n";
    cout << "*****************************************************************\n";
    cout << "\n \n";
    cout << "                      !!당신의 행운 번호!!                       \n";
    cout << "*****************************************************************\n";
    cout << "*                                                               *\n";
    cout << "*         <  >    <  >    <  >    <  >    <  >    <  >          *\n";
    cout << "*                                                               *\n";
    cout << "*****************************************************************\n";

    system("cls");
    for(int i=0;i<6;i++){
        if(arr[i] == ans[i]){
            cnt++;
        }
    }

    cout << "                   <!복권 번호 추첨 드가자!>                     \n";
    cout << "*****************************************************************\n";
    cout << "*                                                               *\n";
    printf("*         <%d>    <%d>    <%d>    <%d>    <%d>    <%d>                *\n",ans[0],ans[1],ans[2],ans[3],ans[4],ans[5]);
    cout << "*                                                               *\n";
    cout << "*****************************************************************\n";
    cout << "\n \n";
    cout << "                      !!당신의 행운 번호!!                       \n";
    cout << "*****************************************************************\n";
    cout << "*                                                               *\n";
    printf("*         <%d>    <%d>    <%d>    <%d>    <%d>    <%d>                *\n",arr[0],arr[1],arr[2],arr[3],arr[4],arr[5]);
    cout << "*                                                               *\n";
    cout << "*****************************************************************\n";

    if(cnt == 6){
        cout << "축하드립니다 1등에 당첨되셨습니다.";
    }
    else if(cnt > 4 && cnt < 6){
        cout << "축하드립니다 2등에 당첨되셨습니다.";
    }
    else if(cnt == 4){
        cout << "축하드립니다 3등에 당첨되셨습니다.";
    }
    else{
        cout << "아쉽지만 당첨에 실패했습니다.";
    }

    return 0;
}
